Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/employment/employment_rights_and_conditions/monitoring_and_surveillance_at_work/garda_clearance_for_employees.html.txt.tmx
Source language: en
Languages: ga

source: • Other personal data issues
ga: • Saincheisteanna eile maidir le sonraí pearsanta

source: The National Vetting Bureau (Children and Vulnerable Persons) Acts 2012-2016, which came into effect on 29 April 2016, make it mandatory for people working with children or vulnerable adults to be vetted by the Garda Síochána National Vetting Bureau
ga: Faoi na hAchtanna um an mBiúró Náisiúnta Grinnfhiosrúcháin (Leanaí agus Daoine Soghonta) 2012-2016, a tháinig i bhfeidhm ar 29 Aibreán 2016, tá sé éigeantach go ngrinnfhiosrófadh Biúró Náisiúnta Grinnfhiosrúcháin an Gharda Síochána daoine a bhíonn ag obair le leanaí nó le daoine soghonta

source: You can read more information in these frequently asked questions about Garda vetting on the National Vetting Bureau website
ga: Is féidir tuilleadh faisnéise a fháil sna ceisteanna coitianta seo ar shuíomh gréasáin an Bhiúró Náisiúnta Grinnfhiosrúcháin

source: The National Vetting Bureau of the Garda Síochána (formerly the Garda Central Vetting Unit) deals with requests to provide information on certain prospective employees or other workers
ga: Déileálann Biúró Grinnfhiosrúcháin an Gharda Síochána (Láraonad Seiceála an Gharda Síochána a bhíodh ann) le hiarratais ar fhaisnéis le haghaidh fostaithe ionchais áirithe nó oibrithe eile a sholáthar

source: The Bureau carries out vetting for relevant organisations that are registered with it
ga: Is é an Biúró dhéanann grinnfhiosrúcháin le haghaidh eagraíochtaí iomchuí a bhfuil cláraithe leis

source: Read more about the vetting procedure here
ga: Tá tuilleadh le léamh faoi nós imeachta an ghrinnfhiosrúcháin anseo

source: Vetting is not done for individuals on a personal basis – see ‘Requesting personal data’ below
ga: Ní dhéantar grinnfhiosrúchán le haghaidh daoine aonair ar bhonn pearsanta – féach ‘Sonraí pearsanta a iarraidh’ thíos

source: Who must be vetted?
ga: Cé a chaithfidh dul faoi ghrinnfhiosrúchán?

source: Under the Acts, any person whose work or activity involves access to children or vulnerable adults must be vetted
ga: Faoi na hAchtanna, ní mór grinnfhiosrúchán a dhéanamh ar dhuine ar bith a bhíonn rochtain acu ar leanaí nó ar dhaoine fásta soghonta mar chuid den obair nó den ghníomhaíocht a mbíonn ar siúl acu

source: Workers include staff, volunteers and those on student placements working for a relevant organisation through which they have access to children and/or vulnerable adults
ga: I measc na n-oibrithe sin, tá baill foirne, oibrithe deonacha agus mic léinn ar shocrúcháin a bhíonn ag obair le haghaidh eagraíochta iomchuí ina mbíonn rochtain acu ar leanaí agus/nó ar dhaoine fásta soghonta

source: Section 2 defines “relevant organisation” as one that employs or permits a person to carry out work or activities which mainly consist of them having access to, or contact with, children or vulnerable adults
ga: In Alt 2, sainmhínítear “eagraíocht iomchuí” mar eagraíocht ina ligtear do dhuine obair nó gníomhaíocht a dhéanamh, nó ina bhfostaítear duine chun obair nó gníomhaíocht a dhéanamh, agus a bhíonn rochtain ar leanaí nó ar dhaoine fásta soghonta, nó teagmháil leo, ina mórchuid riachtanach agus rialta den obair nó den ghníomhaíocht sin

source: Self-employed: Vetting is not conducted for individual persons on a personal basis
ga: Féinfhostaithe: Ní dhéantar grinnfhiosrúcháin do dhaoine aonair ar bhun pearsanta

source: Applications for self-employed people can only be submitted through a relevant organisation as defined in Section 2 of the Act
ga: Ní féidir daoine féinfhostaithe iarratais a dhéanamh ach amháin tríd eagraíocht iomchuí, mar a sainmhínítear in Alt 2 den Acht

source: The work or activities where people working with children and vulnerable adult will require vetting include:
ga: I measc na gcineálacha oibre agus na ngníomhaíochtaí ina bhfuil gá do dhaoine a bhíonn ag obair le leanaí agus daoine soghonta dul faoi ghrinnfhiosrúchán de réir na nAchtanna, tá:

source: • Childcare services – see also ‘Further information’ below
ga: • Seirbhísí chúram leanaí – féach freisin ‘Tuilleadh faisnéise’ thíos

source: • Hospitals and health services
ga: • Ospidéil agus seirbhísí sláinte

source: • Residential services or accommodation for children or vulnerable persons
ga: • Seirbhísí cónaithe nó cóiríocht do leanaí nó do dhaoine soghonta

source: • Treatment, therapy or counselling services for children or vulnerable persons
ga: • Seirbhísí cóireála, teiripe nó chomhairliú do leanaí nó do dhaoine soghonta

source: • Provision of leisure, sporting or physical activities to children or vulnerable persons
ga: • Soláthar gníomhaíochtaí fóillíochta, spóirt nó choirp do leanaí nó do dhaoine soghonta

source: • Promotion of religious beliefs
ga: • Cur chun cinn creidimh

source: Private security employees: Under the Private Security Services Act 2004 Garda vetting has been extended to private security employees (for example, bouncers and nightclub security staff)
ga: Fostaithe slándála príobháidí: Faoin Acht um Sheirbhísí Slándála Príobháidí 2004 leathnaíodh grinnfhiosrúchán an Gharda Síochána amach ionas go n-áirítear fostaithe slándála príobháidí (mar shampla, doirseoirí agus foireann slándála clubanna oíche)

source: When a prospective worker is vetted by the National Vetting Bureau, their criminal record (if any) is disclosed to the authorised liaison person in the registered organisation – see ‘How to apply’ below
ga: Nuair a dhéanann an Biúró Náisiúnta Grinnfhiosrúcháin grinnfhiosrúchán ar oibrí ionchasach, déantar a thaifead/taifead coiriúil (más ann dó) a nochtadh don teagmhálaí údaraithe san eagraíocht chláraithe – féach ‘Conas iarratas a dhéanamh’ thíos

source: A vetting disclosure will include details of all convictions and pending prosecutions and a statement of specified information* (if any) or a statement that there is no criminal record or specified information relating to the person being vetted
ga: Cuirtear san áireamh i nochtadh grinnfhiosrúcháin sonraí ciontaithe agus ionchúisimh ar feitheamh ar bith agus ráiteas ar eolas sonraithe* (más ann dó), nó ráiteas nach ann do thaifead coiriúil nó eolas sonraithe ar bith maidir leis an duine a bhfuil an grinnfhiosrúchán á dhéanamh orthu

source: *Specified information (also known as “soft” information) is information other than criminal convictions where such information leads to a bona-fide belief that a person poses a threat to children or vulnerable people
ga: *Eolas sonraithe (ar a nglaoitear eolas “bog” freisin) is eolas é seo seachas ciontaithe coiriúla, as a n-eascraíonn creidiúint bona-fide gur bagairt atá i nduine áirithe i gcás leanaí nó daoine soghonta

source: Minor offences: Under Section 14A of the Acts convictions for certain minor offences in the District Court that are over 7 years old are not included in the disclosure
ga: Mionchionta: Faoi Alt 14A de na hAchtanna, ní chuirtear san áireamh sa nochtadh mionchiontaithe áirithe sa Chúirt Dúiche a gearrrtar níos mó ná 7 mbliana ó shin

source: However this provision does not apply to offences that are specified in Schedule 3 of the Acts and in Schedule 1 of the Criminal Justice (Spent Convictions and Certain Disclosures) Act 2016
ga: Ní bhaineann an foráil seo le ciontaithe atá sonraithe i Sceideal 3 de na hAchtanna agus i Sceideal 1 den Acht um Cheartas Coiriúil (Ciontaithe Spíonta agus Nochtadh Áirithe), 2016

source: Re-vetting: Section 20 of the Acts provides for the re-vetting of employees and other workers after a certain period of time which is to be set out in regulations
ga: Ghrinnfhiosrú a athdhéanamh: Déanann Alt 20 de na hAchtanna foráil do ghrinnfhiosrú a athdhéanamh ar fhostaithe agus oibrithe eile tar éis tréimhse áirithe ama atá le leagan amach fós sna rialacháin

source: Until then, good practice suggests that re-vetting should be carried out every 5 years
ga: Go dtí sin, is léir ó fhianaise an dea-chleachtais gur ceart grinnfhiosrú a athdhéanamh i ndiaidh 5 bliana

source: The National Vetting Bureau also does vetting which is not governed by the National Vetting Bureau (Children and Vulnerable Persons) Acts 2012–2016 but is required by other legislation
ga: Déanann an Biúró Náisiúnta Grinnfhiosrúcháin roinnt grinnfhiosrúcháin nach dtagann faoi rialú na nAchtanna um an mBiúró Náisiúnta Grinnfhiosrúcháin (Leanaí agus Daoine Soghonta) 2012-2016 ach a bhíonn riachtanach faoi rialacháin eile

source: For example, people applying to work for certain bodies, such as the Garda Síochána, the Courts Service and some government departments have to disclose any spent convictions
ga: Mar shampla, bíonn ar dhaoine a chuireann isteach ar obair le comhlachtaí áirithe, ar nós an Garda Síochána, an tSeirbhís Chúirteanna agus roinnt ranna rialtais nochtadh a dhéanamh faoi chionta ar bith spíonta atá acu

source: The vetting process is the same except that specified information is not disclosed for these Non-Act applications
ga: Is mar an gcéanna an dá phróiseas grinnfhiosrúcháin ach amháin nach nochtar aon eolas sonraithe i gcás na n-iarratas seo nach mbaineann leis an Acht

source: Other personal data issues
ga: Saincheisteanna eile maidir le sonraí pearsanta

source: In general, when you apply for a job that does not require Garda vetting, you must give details of any criminal convictions
ga: De ghnáth, nuair a chuireann duine isteach ar phost nach mbíonn grinnfhiosrúchán Gharda ina chuid riachtanach dóibh, ní mór sonraí ciontaithe ar bith coiriúla a thabhairt

source: However, if you are convicted of an offence covered by Section 5 of the Criminal Justice (Spent Convictions and Certain Disclosures) Act 2016, you do not have to disclose the conviction after 7 years, except in certain circumstances
ga: Ach má ciontaíodh i gcion tú atá clúdaithe ag Alt 5 Acht um Cheartas Coiriúil (Ciontaithe Spíonta agus Nochtadh Áirithe), 2016, ní gá duit an ciontú a nochtadh i ndiaidh 7 mbliana, ach amháin in imthosca áirithe

source: You can read more in our document on spent convictions
ga: Is féidir tuilleadh a léamh in ár ndoiciméad faoi chiontaithe spíonta

source: Under Section 258 of the Children Act 2001, if someone committed an offence when aged under 18 for which they have been found guilty, the offence can be automatically expunged from the record as if never committed, once certain conditions are met
ga: Faoi Alt 258 d'Acht na Leanaí 2001, má rinne duine cion faoi bhun aois 18 agus má chinneadh iad ciontach, ar choinníollacha áirithe d’fhéadfadh go scriosfaí an cion as an taifead mar nach déanta é

source: You can read more information in our document, Children and the criminal justice system
ga: Tá tuilleadh faisnéise ar fáil inár ndoiciméad, Leanaí agus an córas ceartais choiriúil

source: Under the Data Protection Acts 1988 and 2003 (pdf) you have the right to access personal data about you that is held by an Garda Siochána
ga: Faoi na hAchtanna um Chosaint Sonraí 1988 agus 2003 (pdf), tá an ceart agat chun rochtain a fháil ar shonraí pearsanta fút atá á gcoimeád ag an nGarda Síochána

source: You can request this information either in writing or by completing a Data Protection Access Request form (pdf)
ga: Féadfaidh tú an fhaisnéis seo a fháil trí fhoirm Iarratais um Rochtain ar Chosaint Sonraí (pdf)

source: Your written request or completed form should be sent to the National Vetting Bureau of the Garda Síochána – see ‘Where to apply’ below
ga: Ba cheart duit an fhoirm chomhlánaithe a sheoladh ar ais go dtí Biúró Náisiúnta Grinnfhiosrúcháin an Gharda Síochána – féach ‘Cá hait a ndéanfaidh mé iarratas’ thíos

source: You must enclose the following:
ga: Ní mór duit an méid a leanas a cheangal leis an bhfoirm:

source: • Fee of €6.35 – you can pay by cheque, money order or postal order made payable to: The Accountant, Department of Justice
ga: • Táille €6.35 – féadfaidh tú íoc le seic, airgead, ordú airgid nó ordú poist atá iníoctha le: An Cuntasóir, an Roinn Dlí agus Cirt

source: • Photocopy of your passport or birth certificate or driving licence or other identification
ga: • Fótachóip de do phas nó de do theastas breithe nó de do cheadúnas tiomána nó d'aitheantas eile

source: A disclosure in response to your data protection access request will be sent directly to you for your personal use
ga: Seolfar nochtadh mar fhreagairt ar d’iarratas um rochtain ar chosaint sonraí go díreach chugat ar mhaithe le d’úsáid phearsanta

source: If you request a copy of your criminal record from the Garda Síochána, the record will be provided in 2 parts, with the spent convictions provided separately from the other convictions (if any)
ga: Má dhéanann tú iarratas ar chóip de do thaifead coiriúil ón nGarda Síochána, soláthrofar an taifead i 2 chuid

source: It is not the same as Garda vetting, a Police Certificate, a Garda Reference or proof of no convictions
ga: Soláthrófar na ciontuithe spíonta ar leithligh ó na ciontuithe eile (más ann)

source: Employers: Under section 4 of the Data Protection Acts, it is illegal for an employer to require an employee or a potential employee to make a data protection access request (“enforced subject access request”)
ga: Fostóirí: Faoi alt 4 na nAchtanna um Chosaint Sonraí, tá sé neamhdhleathach don fhostóir fostaí nó fostaí ionchasach a éiligh go ndéanfaidh siad iarratas um rochtain ar chosaint sonraí (“iarratas duine éigeantach um rochtain”)

source: The Data Protection Commissioner has published guidance on data protection considerations when vetting prospective employees
ga: Tá treoir faoi chúrsaí um chosaint sonraí agus grinnfhiosrúcháin fostaithe ionchais foilsithe ag an gCoimisinéir Cosanta Sonraí

source: It is important to remember that Garda vetting is not the same as obtaining a Police Certificate which is provided by the Gardaí to people in Ireland who need them for a range of reasons
ga: Ní hionann imréiteach an Gharda Síochána agus Teastas Póilíní a fháil a éilítear le haghaidh fáthanna éagsúla. Tá sé tábhachtach go gcuimhnítear air seo ón tús

source: These reasons may include starting a business abroad or in order to obtain a visa for another country
ga: Cuimsíonn na fáthanna seo víosa a fháil nó gnó a chur ar bun thar lear

source: You can find further information in our document on Police Certificates
ga: Tá tuilleadh eolais faoi Theastas Póilíní le fáil anseo

source: An organisation that requires Garda vetting of individuals must register with the National Vetting Bureau – see ‘Where to apply’ below
ga: Caithfidh eagraíochtaí a bhfuil grinnfhiosrúcháin an Gharda Síochána ag teastáil uathu clárú leis an mBiúró Náisiúnta Grinnfhiosrúcháin - féach 'Cá háit a ndéanfaidh mé iarratas' thíos

source: The organisation must appoint a liaison person to apply for and receive vetting disclosures
ga: Ní mór don eagraíocht teagmhálaí a cheapadh chun iarratais a dhéanamh ar nochtadh grinnfhiosrúcháin agus chun na nochtuithe grinnfhiosrúcháin a fháil

source: Details of the procedure for registering an organisation are on the National Vetting Bureau website
ga: Tá sonraí nósanna imeachta chun eagraíocht a chlárú ar shuíomh gréasáin an Bhiúró

source: If you are applying for a position that requires you to have Garda vetting, you will be sent a Garda vetting application form (electronic or paper)
ga: Má dhéanann tú iarratas ar phost agus más gá grinnfhiosrúcháin an Gharda Síochána a bheith agat, seolfar foirm iarratais maidir le grinnfhiosrúcháin an Gharda Síochána chugat (ar pháipéar nó go leictreonach)

source: You apply to be vetted using e-Vetting but you may apply using a paper form instead
ga: Úsáidtear an córas ríomh-ghrinnfhiosrúcháin chun iarratas a dhéanamh ar ghrinnfhiosrúchán – ach is féidir iarratas a dhéanamh ar pháipéar freisin

source: If you are aged under 18 you must submit a signed parent or guardian consent form
ga: Má tá tú faoi bhun 18 mbliana d’aois, ní mór foirm toilithe a chur isteach atá sínithe ag tuismitheoir nó ag caomhnóir duit

source: To use e-Vetting you must be aged over 16
ga: Chun an córas ríomh-ghrinnfhiosrúcháin a úsáid, ní mór duit bheith os cionn 16 bliana d’aois

source: You must have a valid email address and complete the “proof of identity” process
ga: Is gá seoladh bailí ríomhphoist a bheith agat agus caithfidh tú an próiseas maidir le ‘cruthúnas aitheantais’ a chur i gcrích

source: The e-Vetting procedure is as follows:
ga: Is é seo a leanas an nós imeachta maidir le ríomh-ghrinnfhiosrúcháin:

source: You will be sent a vetting invitation form by the registered organisation where you are applying for a position. You must complete the form and return to the organisation together with proof of your identity
ga: Dearbhóidh an eagraíocht go bhfuil do chruthúnas aitheantais bailí agus cuirfear ríomhphost chugat ina mbeidh nasc chuig an fhoirm iarratais le haghaidh grinnfhiosrúcháin

source: The organisation will validate your proof of identity and send you an email with a link to the vetting application form
ga: Comhlánaigh an fhoirm iarratais le haghaidh grinnfhiosrúcháin ar líne agus cuir chuig an eagraíocht í

source: You complete the vetting application form online and submit it to the organisation
ga: Déanfaidh lucht na heagraíochta athbhreithniú ar d’fhoirm iarratais le haghaidh grinnfhiosrúcháin agus cuirfidh siad ar aghaidh chuig an mBiúró Náisiúnta Grinnfhiosrúcháin í

source: The organisation reviews your vetting application form and submits it to the National Vetting Bureau
ga: Déanann an Biúró Náisiúnta Grinnfhiosrúcháin an t-iarratas a phróiseáil agus cuirtear ar aghaidh nochtadh grinnfhiosrúcháin ansin chuig an eagraíocht

source: 6. The organisation reviews the disclosure and will send you a copy of it
ga: Déanann an eagraíocht an nochtadh a athbhreithniú agus cuirfear cóip chugat

source: You can track your e-Vetting application
ga: Is féidir leat d’iarratas ar ríomh-ghrinnfhiosrúchán a rianú

source: If you wish to dispute the detail in the vetting disclosure, you should write to the liaison person in the organisation with a summary of the basis for your dispute
ga: Más maith leat sonraí an nochtadh ríomh-ghrinnfhiosrúcháin a dhíospóid, ba chóir duit scríobh chuig an teagmhálaí san eagraíocht agus achoimre ar bhonn do dhíospóid a chur chucu

source: The liaison person will then send the complete application file to the National Vetting Bureau to be re-checked
ga: Cuirfidh an teagmhálaí an comhad iarratais ina iomláine chuig an mBiúró Náisiúnta Grinnfhiosrúcháin chun go ndéanfar é a athsheiceáil

source: If you wish to appeal the decision of the Chief Officer of the National Vetting Bureau in relation to disclosure of specified information, there is an independent appeals process
ga: Más mian leat achomharc a dhéanamh ar chinneadh Phríomhoifigeach an Bhiúró Náisiúnta Grinnfhiosrúcháin maidir le nochtadh eolais sonraithe, is ann do phróiseas neamhspleách achomhairc

source: Vetting of childcare workers
ga: Grinnfhiosrúcháin ar oibrithe cúram leanaí

source: The national standards for children’s residential centres include a requirement that all staff, students and volunteers are appropriately vetted, to include references and Garda Síochána and/or police authority criminal record checks, before taking up duties
ga: Éilíonn na caighdeáin náisiúnta le haghaidh ionad cónaithe leanaí go ndéantar grinnfhiosrúcháin cuí ar an bhfoireann, ar na mic léinn agus ar na hoibrithe deonacha go léir, lena mbeidh teistiméireachtaí agus seiceáil an Gharda Síochána agus/nó údarás póilíneachta ar thaifead coiriúil i gceist, sula dtosaíonn siad ag obair

source: The Child Care (Special Care) Regulations 2004 provide that the HSE or voluntary body or any other person providing or maintaining a special care unit will ensure that staff or others who have access to children are appropriately vetted
ga: Forálann na Rialacháin um Chúram Leanaí (Cúram Speisialta) 2004 go ndearbhóidh FSS nó foras deonach nó aon duine a sholáthraíonn nó a chaomhnaíonn aonad um chúram speisialta, go ndéantar grinnfhiosrúcháin cuí ar fhoireann nó ar dhaoine eile a bhfuil rochtain acu ar leanaí

source: That is, by obtaining references and Garda Síochána and/or other police authority criminal record checks
ga: Déanfar sin trí theistiméireachtaí agus seiceáil an Gharda Síochána agus/nó údarás póilíneachta ar thaifead coiriúil a fháil

source: The Child Care Act 1991 (Early Years Services) Regulations 2016 require pre-school childcare services to obtain references and Garda vetting for all staff, students and volunteers who have access to children
ga: Éilíonn na Rialacháin faoin Acht um Chúram Leanaí (Seirbhísí Luathbhlianta) 2016 go bhfaigheann seirbhísí chúram leanaí réamhscoile teistiméireachtaí agus grinnfhiosrúcháin an Gharda Síochána do gach fostaí, mac léinn agus oibrí deonach atá rochtain ar leanaí acu

source: The Child Care (Placement of Children in Foster Care) Regulations 1995 and the Child Care (Placement of Children with Relatives) Regulations 1995 require that foster parents or relatives with whom children in the care of the HSE are to be placed give authorisation to allow the HSE to obtain a statement from the Garda Síochána as to whether there are any convictions against them or any relevant member of the household and to provide the names of two referees for reference purposes
ga: Éilíonn na Rialacháin um Chúram Leanaí (Leanaí a Fhágáil faoi Chúram Altrama) 1995 agus na Rialacháin um Chúram Leanaí (Leanaí a Fhágáil le Gaolta) 1995 go gceadaíonn tuismitheoirí altrama nó gaolta lena mbeidh leanaí atá faoi chúram an FSS curtha, ar an FSS ráiteas a fháil ón Garda Síochána ag sonrú aon chiontú ina n-aghaidh nó in aghaidh aon bhall ábharthach tí, agus go soláthraíonn siad ainmneacha dhá mholtóir ar mhaithe le teistméireachtaí
